bigbass1997/PIC-CNT64/p18lf4550.inc
;----- CONFIG6H Options --------------------------------------------------
_WRTC_ON_6H          EQU  H'DF'; Configuration registers (300000-3000FFh) are write-protected
_WRTC_OFF_6H         EQU  H'FF'; Configuration registers (300000-3000FFh) are not write-protected

_WRTB_ON_6H          EQU  H'BF'; Boot block (000000-0007FFh) is write-protected
_WRTB_OFF_6H         EQU  H'FF'; Boot block (000000-0007FFh) is not write-protected

_WRTD_ON_6H          EQU  H'7F'; Data EEPROM is write-protected
_WRTD_OFF_6H         EQU  H'FF'; Data EEPROM is not write-protected

;----- CONFIG7L Options --------------------------------------------------
_EBTR0_ON_7L         EQU  H'FE'; Block 0 (000800-001FFFh) is protected from table reads executed in other blocks
_EBTR0_OFF_7L        EQU  H'FF'; Block 0 (000800-001FFFh) is not protected from table reads executed in other blocks

_EBTR1_ON_7L         EQU  H'FD'; Block 1 (002000-003FFFh) is protected from table reads executed in other blocks
_EBTR1_OFF_7L        EQU  H'FF'; Block 1 (002000-003FFFh) is not protected from table reads executed in other blocks

_EBTR2_ON_7L         EQU  H'FB'; Block 2 (004000-005FFFh) is protected from table reads executed in other blocks
_EBTR2_OFF_7L        EQU  H'FF'; Block 2 (004000-005FFFh) is not protected from table reads executed in other blocks

_EBTR3_ON_7L         EQU  H'F7'; Block 3 (006000-007FFFh) is protected from table reads executed in other blocks
_EBTR3_OFF_7L        EQU  H'FF'; Block 3 (006000-007FFFh) is not protected from table reads executed in other blocks

;----- CONFIG7H Options --------------------------------------------------
_EBTRB_ON_7H         EQU  H'BF'; Boot block (000000-0007FFh) is protected from table reads executed in other blocks
_EBTRB_OFF_7H        EQU  H'FF'; Boot block (000000-0007FFh) is not protected from table reads executed in other blocks


;----- DEVID Equates --------------------------------------------------
_DEVID1          EQU  H'3FFFFE'
_DEVID2          EQU  H'3FFFFF'

;----- IDLOC Equates --------------------------------------------------
_IDLOC0          EQU  H'200000'
_IDLOC1          EQU  H'200001'
_IDLOC2          EQU  H'200002'
_IDLOC3          EQU  H'200003'
_IDLOC4          EQU  H'200004'
_IDLOC5          EQU  H'200005'
_IDLOC6          EQU  H'200006'
_IDLOC7          EQU  H'200007'

        LIST
